{"class_name": "Model", "config": {"name": "model_56", "layers": [{"name": "input_42", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 113208], "dtype": "float32", "sparse": false, "name": "input_42"}, "inbound_nodes": []}, {"name": "reshape_21", "class_name": "Reshape", "config": {"name": "reshape_21", "trainable": true, "target_shape": [89, 159, 8]}, "inbound_nodes": [[["input_42", 0, 0, {}]]]}, {"name": "conv2d_138", "class_name": "Conv2D", "config": {"name": "conv2d_138", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_21", 0, 0, {}]]]}, {"name": "up_sampling2d_58", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_58", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["conv2d_138", 0, 0, {}]]]}, {"name": "conv2d_139", "class_name": "Conv2D", "config": {"name": "conv2d_139", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_58", 0, 0, {}]]]}, {"name": "up_sampling2d_59", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_59", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["conv2d_139", 0, 0, {}]]]}, {"name": "conv2d_140", "class_name": "Conv2D", "config": {"name": "conv2d_140", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_59", 0, 0, {}]]]}, {"name": "up_sampling2d_60", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_60", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "bilinear"}, "inbound_nodes": [[["conv2d_140", 0, 0, {}]]]}, {"name": "conv2d_141", "class_name": "Conv2D", "config": {"name": "conv2d_141", "trainable": true, "filters": 8, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_60", 0, 0, {}]]]}, {"name": "conv2d_142", "class_name": "Conv2D", "config": {"name": "conv2d_142", "trainable": true, "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_141", 0, 0, {}]]]}], "input_layers": [["input_42", 0, 0]], "output_layers": [["conv2d_142", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}